{
  "es": {
    "web": "Desarrollador web desde Buenos Aires, Argentina",
    "divider-education": "Educación",
    "divider-projects": "Proyectos",
    "divider-about-me": "Sobre mi",
    "header-projects": "&lt;Proyectos/&gt;",
    "header-about-me": "&lt;Sobre mi/&gt;",
    "header-contact": "&lt;Contacto/&gt;",
    "name": "Aaron Cuellar",
    "saludo-inicio": "Hola! Soy <span class='name'>Aaron Cuellar</span>",
    "p-inicio": "Apasionado por la tecnologia, la ciencia y el saber.",
    "year-carrer": "2022 - actualidad",
    "title-carrer": "Lic. Ciencias de la Computacion - UBA",
    "description-carrer": "Carrera de grado ofrecida por la FCEN - UBA. hasta el momento adquiri conocimientos sobre algoritmos, estructuras de datos complejidades algoritmicas, especificacion de programas, funcionamiento bajo nivel de la computadora, además de fundamentos matemáticos y teóricos relacionados con la computación. Además de los conocimientos técnicos, he fortalecido habilidades como el trabajo en equipo, la gestión eficiente del tiempo y la constancia.",
    "title-ingles": "Curso de Ingles",
    "description-ingles": "Formación en inglés elemental impartida por la Facultad de Ciencias Exactas y Naturales de la Universidad de Buenos Aires. Este curso refuerza habilidades básicas en comprensión lectora, escritura y comunicación oral.",
    "title-pc": "Reparacion Pc's",
    "description-pc": "Capacitacion y practicas sobre reparacion, mantenimiento, instalacion de hardware y software. Incluyó diagnóstico de problemas, ensamblaje de computadoras y optimización de sistemas, desarrollando habilidades esenciales para el soporte técnico y la atención al cliente.",
    "title-colegio": "Colegio San Pio X",
    "description-colegio": "Educación secundaria con orientación en Economía, que incluyó formación en administración, contabilidad y principios económicos basicos, fortaleciendo habilidades como la organización y la creatividad.",
    "text-about-me-1": "¡Hola! ¿Cómo estás? Te cuento un poco sobre mí. Tengo 21 años y resido en Buenos Aires, Argentina. Actualmente estoy estudiando la carrera de <strong>Lic. Cs. Computacion</strong>, mientras paralelamente me formo como desarrollador web.",
    "text-about-me-2": "Mi objetivo es <strong>convertirme en un profesional fullstack.</strong> Disfruto cada nuevo aprendizaje y valoro profundamente el apoyo de esta increíble comunidad. Soy una persona a la que le encanta afrontar nuevos retos y que se siente <strong> preparada para aportar valor a la industria tecnológica.</strong>👨‍💼💻",
    "contact": "Contacto",
    "text-contact": "No dudes en comunicarte escribiendo a cualquiera de <a href='' class='a-contact'>mis redes</a> sociales o enviándome un correo. ¡Espero conectar contigo y explorar oportunidades juntos! 📞🚀",

    "title-project-1": "Alinks",
    "description-project-1": "Alinks es una aplicación web desarrollada con React y Firebase que permite a los usuarios registrarse, gestionar sus propios enlaces y compartir un perfil público con sus links destacados. Utiliza Firebase Authentication para el login con autorregistro, Firestore para el almacenamiento de datos, React Router DOM para la navegación, protegida basada en el estado de autenticación.",
    "title-project-2": "Weather App",
    "description-project-2": "Aplicacion web que permite buscar una ciudad y consultar su clima actual, el pronóstico diario y por hora. Búsqueda de ciudades con autocompletado y debounce utilizando un trie creado a partir de un json local de ciudades comunes. Customhook para obtener y formatear datos meteorológicos por nombre de ciudad llamando a API's, utiliza useCallback.",
    "title-project-3": "Cli Task",
    "description-project-3": "Aplicación CLI para gestionar tareas, desarrollada en Node.js y conectada a una base de datos MongoDB. Permite realizar operaciones CRUD (crear, leer, actualizar y eliminar) desde la terminal. Utiliza commander para el manejo de comandos, inquirer para entradas interactivas del usuario, picocolors y chalk para mejorar la visualización con estilos y colores en la consola.",
    "title-project-4": "Todo App",
    "description-project-4": "Aplicación web para gestionar tareas. Permite agregar tareas con título, descripción, fecha límite y prioridad; marcarlas como completadas, editarlas, eliminarlas y filtrarlas por prioridad. Persistencia automatica mediante localStorage. Utiliza un custom hook que combina useReducer con localStorage para manejar el estado, useContext para acceso global, useEffect para sincronización y useRef para referencias en formularios."
  },
  "en": {
    "web": "Web developer from Buenos Aires, Argentina",
    "divider-education": "Education",
    "divider-projects": "Projects",
    "divider-about-me": "About me",
    "header-projects": "&lt;Projects/&gt;",
    "header-about-me": "&lt;About me/&gt;",
    "header-contact": "&lt;Contact/&gt;",
    "name": "Aaron Cuellar",
    "saludo-inicio": "Hello! I'm <span class='name'>Aaron Cuellar</span>",
    "p-inicio": "Passionate about technology, science and knowledge.",
    "year-carrer": "2022 - present",
    "title-carrer": "Computer Science - UBA",
    "description-carrer": "Degree offered by FCEN - UBA. So far I have acquired knowledge about algorithms, data structures, algorithmic complexities, program specification, low-level computer operation, as well as mathematical and theoretical foundations related to computing. In addition to technical knowledge, I have strengthened skills such as teamwork, efficient time management and perseverance.",
    "title-ingles": "English course",
    "description-ingles": "Elementary English training provided by the Faculty of Exact and Natural Sciences of the University of Buenos Aires. This course reinforces basic skills in reading comprehension, writing and oral communication.",
    "title-pc": "Pc's repair",
    "description-pc": "Training and practices on repair, maintenance, hardware and software installation. It included diagnosis of problems, computer assembly and system optimization, developing essential skills for technical support and customer service.",
    "title-colegio": "San Pio X Institute",
    "description-colegio": "Secondary education with a focus on Economics, which included training in administration, accounting and basic economic principles, strengthening skills such as organization and creativity.",
    "text-about-me-1": "Hello! How are you? Let me tell you a little about myself. I am 21 years old and I live in Buenos Aires, Argentina. I am currently studying the degree in <strong>Computer Science</strong>, while at the same time I am training as a web developer.",
    "text-about-me-2": "My objetive is to <strong>become a fullstack professional.</strong> I enjoy every new learning and deeply value the support of this incredible community. I am a person who loves to face new challenges and who feels <strong>prepared to add value to the technology industry.</strong>👨‍💼💻",
    "contact": "Contact",
    "text-contact": "Do not hesitate to contact me by writing to any of <a href='' class='a-contact'>my</a> social networks or sending me an email. I hope to connect with you and explore opportunities together! 📞🚀",

    "title-project-1": "ALinks",
    "description-project-1": "Alinks is a web application built with React and Firebase that allows users to register, manage their personal links, and share a public profile with their featured links. It uses Firebase Authentication for sign-up and login, Firestore for data storage, and React Router DOM for navigation, which is protected based on the authentication state.",
    "title-project-2": "Weather App",
    "description-project-2": "A web application that allows users to search for a city and check its current weather, daily forecast, and hourly forecast. City search includes autocomplete and debounce using a trie built from a local JSON file of common cities. A custom hook is used to fetch and format weather data by city name, calling APIs and utilizing useCallback.",
    "title-project-3": "Cli Task",
    "description-project-3": "A CLI application for managing tasks, developed in Node.js and connected to a MongoDB database. It allows performing CRUD operations (create, read, update, and delete) from the terminal. It uses commander for command handling, inquirer for interactive user inputs, and picocolors and chalk for enhancing visualization with styles and colors in the console.",
    "title-project-4": "Todo App",
    "description-project-4": "Web application for managing tasks. It allows you to add tasks with a title, description, due date, and priority; mark them as completed, edit, delete, and filter them by priority. Data is automatically saved to localStorage to preserve tasks between sessions. It uses a custom hook that combines useReducer with localStorage to manage state, useContext for global access, useEffect for synchronization, and useRef for handling form references."
  }
}
